{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Расширенный код Хемминга"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Исходное сообщение: 1101011010111011\n",
      "Закодированное сообщение: 001010100110101011011\n",
      "Сообщение с ошибкой на позиции 5: 001000100110101011011\n",
      "Ошибка на позиции: 5\n",
      "Исправленное сообщение: 001010100110101011011\n",
      "Исправленное сообщение: 001010100110101011011\n"
     ]
    }
   ],
   "source": [
    "def calculate_parity_bits(data):\n",
    "    \"\"\"Вычисление контрольных битов по алгоритму Хэмминга\"\"\"\n",
    "    n = len(data)\n",
    "    \n",
    "    # Определяем количество контрольных битов\n",
    "    r = 0\n",
    "    while 2 ** r < n + r + 1:\n",
    "        r += 1\n",
    "    \n",
    "    # Контрольные биты изначально равны 0\n",
    "    res = []\n",
    "    j = 0\n",
    "\n",
    "    # Вставляем данные и контрольные биты\n",
    "    for i in range(1, n + r + 1):\n",
    "        if (i & (i - 1)) == 0:  # Позиции для контрольных битов (степени двойки)\n",
    "            res.append(0)\n",
    "        else:\n",
    "            res.append(int(data[j]))\n",
    "            j += 1\n",
    "    \n",
    "    # Вычисление значений контрольных битов\n",
    "    for i in range(r):\n",
    "        parity_bit_position = 2 ** i\n",
    "        parity_bit_value = 0\n",
    "        for j in range(parity_bit_position - 1, len(res), 2 * parity_bit_position):\n",
    "            for k in range(j, min(j + parity_bit_position, len(res))):\n",
    "                parity_bit_value ^= res[k]\n",
    "        res[parity_bit_position - 1] = parity_bit_value  # Установка значения контрольного бита\n",
    "    \n",
    "    return ''.join(map(str, res))\n",
    "\n",
    "def introduce_error(data):\n",
    "    \"\"\"Вводит ошибку в одном бите сообщения\"\"\"\n",
    "    error_pos = 5  # Например, ошибка на позиции 5\n",
    "    data = list(data)\n",
    "    data[error_pos - 1] = '1' if data[error_pos - 1] == '0' else '0'  # В Python индекс на 1 меньше\n",
    "    return ''.join(data), error_pos\n",
    "\n",
    "def detect_and_correct_error(data):\n",
    "    \"\"\"Распознавание и исправление ошибки на основе контрольных битов\"\"\"\n",
    "    n = len(data)\n",
    "    \n",
    "    # Определяем количество контрольных битов\n",
    "    r = 0\n",
    "    while 2 ** r < n:\n",
    "        r += 1\n",
    "    \n",
    "    # Проверка контрольных битов\n",
    "    error_pos = 0\n",
    "    for i in range(r):\n",
    "        parity_bit_position = 2 ** i\n",
    "        parity_bit_value = 0\n",
    "        for j in range(parity_bit_position - 1, n, 2 * parity_bit_position):\n",
    "            for k in range(j, min(j + parity_bit_position, n)):\n",
    "                parity_bit_value ^= int(data[k])\n",
    "        if parity_bit_value != 0:\n",
    "            error_pos += parity_bit_position\n",
    "    \n",
    "    # Если ошибка найдена\n",
    "    if error_pos > 0:\n",
    "        print(f\"Ошибка на позиции: {error_pos}\")\n",
    "        data = list(data)\n",
    "        # Исправляем ошибку\n",
    "        data[error_pos - 1] = '1' if data[error_pos - 1] == '0' else '0'  # Исправление ошибки\n",
    "        corrected_message = ''.join(data)\n",
    "        print(f\"Исправленное сообщение: {corrected_message}\")\n",
    "    else:\n",
    "        print(\"Ошибок не обнаружено!\")\n",
    "        corrected_message = data\n",
    "    \n",
    "    # Удаляем контрольные биты и восстанавливаем исходные данные\n",
    "    original_message = [corrected_message[i] for i in range(n) if (i + 1 & (i + 1)) != 0]\n",
    "    return ''.join(original_message)\n",
    "\n",
    "# Пример использования\n",
    "if __name__ == \"__main__\":\n",
    "    # Входные данные\n",
    "    message = '1101011010111011'  # 16-битное сообщение\n",
    "    print(f\"Исходное сообщение: {message}\")\n",
    "    \n",
    "    # Кодирование по Хэммингу\n",
    "    encoded_message = calculate_parity_bits(message)\n",
    "    print(f\"Закодированное сообщение: {encoded_message}\")\n",
    "    \n",
    "    # Ввод ошибки в сообщении\n",
    "    erroneous_message, error_position = introduce_error(encoded_message)\n",
    "    print(f\"Сообщение с ошибкой на позиции {error_position}: {erroneous_message}\")\n",
    "    \n",
    "    # Обнаружение и исправление ошибки\n",
    "    corrected_message = detect_and_correct_error(erroneous_message)\n",
    "    print(f\"Исправленное сообщение: {corrected_message}\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
